socialNetwork/results/productpage/20251121_204534/st2-NIChaRes-60/100.txt
Running 1m test @ http://128.105.146.152:80
  100 threads and 100 connections

  Thread calibration: mean lat.: 96.352ms, rate sampling interval: 88ms
  Thread calibration: mean lat.: 27.273ms, rate sampling interval: 66ms
  Thread calibration: mean lat.: 119.811ms, rate sampling interval: 482ms
  Thread calibration: mean lat.: 80.408ms, rate sampling interval: 107ms
  Thread calibration: mean lat.: 84.192ms, rate sampling interval: 86ms
  Thread calibration: mean lat.: 32.548ms, rate sampling interval: 75ms
  Thread calibration: mean lat.: 29.538ms, rate sampling interval: 65ms
  Thread calibration: mean lat.: 91.666ms, rate sampling interval: 68ms
  Thread calibration: mean lat.: 76.002ms, rate sampling interval: 114ms
  Thread calibration: mean lat.: 52.710ms, rate sampling interval: 77ms
  Thread calibration: mean lat.: 30.540ms, rate sampling interval: 71ms
  Thread calibration: mean lat.: 48.479ms, rate sampling interval: 65ms
  Thread calibration: mean lat.: 96.472ms, rate sampling interval: 86ms
  Thread calibration: mean lat.: 29.333ms, rate sampling interval: 66ms
  Thread calibration: mean lat.: 286.029ms, rate sampling interval: 1904ms
  Thread calibration: mean lat.: 106.586ms, rate sampling interval: 118ms
  Thread calibration: mean lat.: 135.969ms, rate sampling interval: 687ms
  Thread calibration: mean lat.: 71.736ms, rate sampling interval: 210ms
  Thread calibration: mean lat.: 28.304ms, rate sampling interval: 70ms
  Thread calibration: mean lat.: 78.086ms, rate sampling interval: 91ms
  Thread calibration: mean lat.: 26.210ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 29.238ms, rate sampling interval: 70ms
  Thread calibration: mean lat.: 30.842ms, rate sampling interval: 67ms
  Thread calibration: mean lat.: 130.710ms, rate sampling interval: 891ms
  Thread calibration: mean lat.: 31.909ms, rate sampling interval: 108ms
  Thread calibration: mean lat.: 27.713ms, rate sampling interval: 64ms
  Thread calibration: mean lat.: 29.248ms, rate sampling interval: 70ms
  Thread calibration: mean lat.: 26.634ms, rate sampling interval: 64ms
  Thread calibration: mean lat.: 26.666ms, rate sampling interval: 60ms
  Thread calibration: mean lat.: 228.560ms, rate sampling interval: 1813ms
  Thread calibration: mean lat.: 81.585ms, rate sampling interval: 85ms
  Thread calibration: mean lat.: 47.837ms, rate sampling interval: 79ms
  Thread calibration: mean lat.: 46.031ms, rate sampling interval: 65ms
  Thread calibration: mean lat.: 95.719ms, rate sampling interval: 332ms
  Thread calibration: mean lat.: 32.713ms, rate sampling interval: 75ms
  Thread calibration: mean lat.: 38.403ms, rate sampling interval: 65ms
  Thread calibration: mean lat.: 27.957ms, rate sampling interval: 69ms
  Thread calibration: mean lat.: 166.979ms, rate sampling interval: 74ms
  Thread calibration: mean lat.: 114.548ms, rate sampling interval: 769ms
  Thread calibration: mean lat.: 125.964ms, rate sampling interval: 84ms
  Thread calibration: mean lat.: 204.821ms, rate sampling interval: 809ms
  Thread calibration: mean lat.: 24.756ms, rate sampling interval: 59ms
  Thread calibration: mean lat.: 28.337ms, rate sampling interval: 73ms
  Thread calibration: mean lat.: 77.002ms, rate sampling interval: 88ms
  Thread calibration: mean lat.: 30.251ms, rate sampling interval: 73ms
  Thread calibration: mean lat.: 32.177ms, rate sampling interval: 82ms
  Thread calibration: mean lat.: 130.298ms, rate sampling interval: 100ms
  Thread calibration: mean lat.: 103.382ms, rate sampling interval: 84ms
  Thread calibration: mean lat.: 66.381ms, rate sampling interval: 458ms
  Thread calibration: mean lat.: 31.344ms, rate sampling interval: 72ms
  Thread calibration: mean lat.: 106.801ms, rate sampling interval: 94ms
  Thread calibration: mean lat.: 28.676ms, rate sampling interval: 67ms
  Thread calibration: mean lat.: 90.363ms, rate sampling interval: 353ms
  Thread calibration: mean lat.: 25.973ms, rate sampling interval: 55ms
  Thread calibration: mean lat.: 25.968ms, rate sampling interval: 56ms
  Thread calibration: mean lat.: 26.729ms, rate sampling interval: 58ms
  Thread calibration: mean lat.: 26.627ms, rate sampling interval: 70ms
  Thread calibration: mean lat.: 34.296ms, rate sampling interval: 61ms
  Thread calibration: mean lat.: 28.850ms, rate sampling interval: 66ms
  Thread calibration: mean lat.: 128.266ms, rate sampling interval: 69ms
  Thread calibration: mean lat.: 197.851ms, rate sampling interval: 727ms
  Thread calibration: mean lat.: 110.671ms, rate sampling interval: 79ms
  Thread calibration: mean lat.: 144.592ms, rate sampling interval: 373ms
  Thread calibration: mean lat.: 33.624ms, rate sampling interval: 81ms
  Thread calibration: mean lat.: 74.664ms, rate sampling interval: 69ms
  Thread calibration: mean lat.: 58.296ms, rate sampling interval: 73ms
  Thread calibration: mean lat.: 28.540ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 164.994ms, rate sampling interval: 1106ms
  Thread calibration: mean lat.: 103.284ms, rate sampling interval: 837ms
  Thread calibration: mean lat.: 80.603ms, rate sampling interval: 57ms
  Thread calibration: mean lat.: 31.441ms, rate sampling interval: 70ms
  Thread calibration: mean lat.: 166.592ms, rate sampling interval: 1025ms
  Thread calibration: mean lat.: 27.748ms, rate sampling interval: 63ms
  Thread calibration: mean lat.: 98.030ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 29.752ms, rate sampling interval: 67ms
  Thread calibration: mean lat.: 88.716ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 102.253ms, rate sampling interval: 1069ms
  Thread calibration: mean lat.: 30.084ms, rate sampling interval: 78ms
  Thread calibration: mean lat.: 62.270ms, rate sampling interval: 79ms
  Thread calibration: mean lat.: 26.429ms, rate sampling interval: 63ms
  Thread calibration: mean lat.: 85.842ms, rate sampling interval: 92ms
  Thread calibration: mean lat.: 26.444ms, rate sampling interval: 67ms
  Thread calibration: mean lat.: 31.402ms, rate sampling interval: 67ms
  Thread calibration: mean lat.: 31.405ms, rate sampling interval: 72ms
  Thread calibration: mean lat.: 88.261ms, rate sampling interval: 78ms
  Thread calibration: mean lat.: 173.482ms, rate sampling interval: 1432ms
  Thread calibration: mean lat.: 31.395ms, rate sampling interval: 75ms
  Thread calibration: mean lat.: 169.811ms, rate sampling interval: 1576ms
  Thread calibration: mean lat.: 119.613ms, rate sampling interval: 65ms
  Thread calibration: mean lat.: 63.329ms, rate sampling interval: 81ms
  Thread calibration: mean lat.: 291.166ms, rate sampling interval: 1789ms
  Thread calibration: mean lat.: 106.273ms, rate sampling interval: 673ms
  Thread calibration: mean lat.: 109.200ms, rate sampling interval: 132ms
  Thread calibration: mean lat.: 29.690ms, rate sampling interval: 66ms
  Thread calibration: mean lat.: 45.888ms, rate sampling interval: 186ms
  Thread calibration: mean lat.: 68.652ms, rate sampling interval: 82ms
  Thread calibration: mean lat.: 98.244ms, rate sampling interval: 72ms
  Thread calibration: mean lat.: 95.413ms, rate sampling interval: 867ms
  Thread calibration: mean lat.: 60.531ms, rate sampling interval: 375ms
  Thread calibration: mean lat.: 152.849ms, rate sampling interval: 67ms

-----------------------------------------------------------------------
Test Results @ http://128.105.146.152:80 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    24.40ms    5.26ms  42.85ms   76.28%
    Req/Sec     0.96      3.57    16.00     93.23%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   24.00ms
 75.000%   26.75ms
 90.000%   30.21ms
 99.000%   42.85ms
 99.900%   53.41ms
 99.990%   67.01ms
 99.999%   67.01ms
100.000%   67.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.667     0.000000            1         1.00
      18.783     0.100000          496         1.11
      20.143     0.200000          989         1.25
      21.583     0.300000         1484         1.43
      23.023     0.400000         1984         1.67
      23.999     0.500000         2478         2.00
      24.543     0.550000         2721         2.22
      25.087     0.600000         2970         2.50
      25.567     0.650000         3220         2.86
      26.095     0.700000         3465         3.33
      26.751     0.750000         3714         4.00
      27.087     0.775000         3833         4.44
      27.535     0.800000         3958         5.00
      28.079     0.825000         4080         5.71
      28.639     0.850000         4207         6.67
      29.327     0.875000         4328         8.00
      29.679     0.887500         4391         8.89
      30.207     0.900000         4451        10.00
      30.767     0.912500         4513        11.43
      31.471     0.925000         4575        13.33
      32.319     0.937500         4636        16.00
      32.895     0.943750         4670        17.78
      33.471     0.950000         4699        20.00
      34.239     0.956250         4731        22.86
      35.199     0.962500         4760        26.67
      36.319     0.968750         4791        32.00
      36.991     0.971875         4806        35.56
      37.663     0.975000         4823        40.00
      38.271     0.978125         4837        45.71
      39.327     0.981250         4853        53.33
      40.319     0.984375         4869        64.00
      40.831     0.985938         4876        71.11
      41.727     0.987500         4884        80.00
      42.271     0.989062         4892        91.43
      43.167     0.990625         4899       106.67
      44.671     0.992188         4907       128.00
      45.055     0.992969         4911       142.22
      45.791     0.993750         4915       160.00
      46.815     0.994531         4918       182.86
      47.167     0.995313         4922       213.33
      47.487     0.996094         4927       256.00
      47.743     0.996484         4928       284.44
      48.351     0.996875         4930       320.00
      48.767     0.997266         4932       365.71
      48.991     0.997656         4934       426.67
      50.335     0.998047         4936       512.00
      50.431     0.998242         4937       568.89
      51.551     0.998437         4938       640.00
      53.183     0.998633         4939       731.43
      53.407     0.998828         4940       853.33
      55.007     0.999023         4941      1024.00
      55.007     0.999121         4941      1137.78
      55.455     0.999219         4942      1280.00
      55.455     0.999316         4942      1462.86
      57.311     0.999414         4943      1706.67
      57.311     0.999512         4943      2048.00
      57.311     0.999561         4943      2275.56
      58.975     0.999609         4944      2560.00
      58.975     0.999658         4944      2925.71
      58.975     0.999707         4944      3413.33
      58.975     0.999756         4944      4096.00
      58.975     0.999780         4944      4551.11
      67.007     0.999805         4945      5120.00
      67.007     1.000000         4945          inf
#[Mean    =       24.404, StdDeviation   =        5.261]
#[Max     =       66.944, Total count    =         4945]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5977 requests in 1.00m, 75.28MB read
  Socket errors: connect 0, read 0, write 0, timeout 400
Requests/sec:     99.60  
Transfer/sec:      1.25MB